<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"EKS","backend":"60748d58729bf4548a54266386c47e6c390cab0e81de2f344b56ea8c073bdad0","plan_job_ref":"Job tf-plan / Kabisa-playground-anas #8 at https://github.com/anasgrt/eks_project/actions/runs/8583302163","plan_out_hash":"a83e50b73a69983dfff5daa4399c587a7c7135f40bc552665ce4df210d0036f9","plan_hash":"b2422442f42539e78a142b6ee68349892a61129d49b3c5b8115ae7a1a2b2383e","plan_text_format":"diff-trunc","version":"1.42.0","closed":true} -->
Terraform plan for __EKS__
<details>
<summary>Plan: 78 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.education_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "education_cluster" {
+       access_config             = (known after apply)
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = (known after apply)
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       kubernetes_network_config = (known after apply)
+       name                      = "education-cluster"
+       outpost_config            = (known after apply)
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = (known after apply)
+       version                   = (known after apply)
+       vpc_config                = (known after apply)
    }

  # aws_iam_role_policy_attachment.blue_ebs_csi_role_policy_attach will be created
+   resource "aws_iam_role_policy_attachment" "blue_ebs_csi_role_policy_attach" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
+       role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.green_ebs_csi_role_policy_attach will be created
+   resource "aws_iam_role_policy_attachment" "green_ebs_csi_role_policy_attach" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
+       role       = (known after apply)
    }

  # helm_release.alb_ingress_controller will be created
+   resource "helm_release" "alb_ingress_controller" {
+       atomic                     = false
+       chart                      = "aws-load-balancer-controller"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "alb-ingress-controller"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://aws.github.io/eks-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = (known after apply)
+       verify                     = false
+       version                    = "1.7.2"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubernetes_service_account.service-account will be created
+   resource "kubernetes_service_account" "service-account" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           annotations      = (known after apply)
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component"  = "controller"
+               "app.kubernetes.io/managed-by" = "Helm"
+               "app.kubernetes.io/name"       = "aws-load-balancer-controller"
            }
+           name             = "aws-load-balancer-controller"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.alb_ingress_controller_role.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"
+           sid     = "ExplicitSelfRoleAssumption"

+           condition {
+               test     = "ArnLike"
+               values   = [
+                   "arn:aws:iam::820116308106:role/CodeCationALBIngressController",
                ]
+               variable = "aws:PrincipalArn"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "AWS"
            }
        }
+       statement {
+           actions = [
+               "sts:AssumeRoleWithWebIdentity",
            ]
+           effect  = "Allow"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "sts.amazonaws.com",
                ]
+               variable = (known after apply)
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
+               variable = (known after apply)
            }

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "Federated"
            }
        }
    }

  # module.alb_ingress_controller_role.aws_iam_policy.load_balancer_controller[0] will be created
+   resource "aws_iam_policy" "load_balancer_controller" {
+       arn         = (known after apply)
+       description = "Provides permissions for AWS Load Balancer Controller addon"
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "AmazonEKS_AWS_Load_Balancer_Controller-"
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "iam:CreateServiceLinkedRole"
+                       Condition = {
+                           StringEquals = {
+                               "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:DescribeTrustStores",
+                           "elasticloadbalancing:DescribeTargetHealth",
+                           "elasticloadbalancing:DescribeTargetGroups",
+                           "elasticloadbalancing:DescribeTargetGroupAttributes",
+                           "elasticloadbalancing:DescribeTags",
+                           "elasticloadbalancing:DescribeSSLPolicies",
+                           "elasticloadbalancing:DescribeRules",
+                           "elasticloadbalancing:DescribeLoadBalancers",
+                           "elasticloadbalancing:DescribeLoadBalancerAttributes",
+                           "elasticloadbalancing:DescribeListeners",
+                           "elasticloadbalancing:DescribeListenerCertificates",
+                           "ec2:GetCoipPoolUsage",
+                           "ec2:DescribeVpcs",
+                           "ec2:DescribeVpcPeeringConnections",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSubnets",
+                           "ec2:DescribeSecurityGroups",
+                           "ec2:DescribeNetworkInterfaces",
+                           "ec2:DescribeInternetGateways",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeCoipPools",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:DescribeAddresses",
+                           "ec2:DescribeAccountAttributes",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action   = [
+                           "wafv2:GetWebACLForResource",
+                           "wafv2:GetWebACL",
+                           "wafv2:DisassociateWebACL",
+                           "wafv2:AssociateWebACL",
+                           "waf-regional:GetWebACLForResource",
+                           "waf-regional:GetWebACL",
+                           "waf-regional:DisassociateWebACL",
+                           "waf-regional:AssociateWebACL",
+                           "shield:GetSubscriptionState",
+                           "shield:DescribeProtection",
+                           "shield:DeleteProtection",
+                           "shield:CreateProtection",
+                           "iam:ListServerCertificates",
+                           "iam:GetServerCertificate",
+                           "cognito-idp:DescribeUserPoolClient",
+                           "acm:ListCertificates",
+                           "acm:DescribeCertificate",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action   = [
+                           "ec2:RevokeSecurityGroupIngress",
+                           "ec2:CreateSecurityGroup",
+                           "ec2:AuthorizeSecurityGroupIngress",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           Null         = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
+                           StringEquals = {
+                               "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
+                   {
+                       Action    = [
+                           "ec2:DeleteTags",
+                           "ec2:CreateTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
+                   {
+                       Action    = [
+                           "ec2:RevokeSecurityGroupIngress",
+                           "ec2:DeleteSecurityGroup",
+                           "ec2:AuthorizeSecurityGroupIngress",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:CreateTargetGroup",
+                           "elasticloadbalancing:CreateLoadBalancer",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:DeleteRule",
+                           "elasticloadbalancing:DeleteListener",
+                           "elasticloadbalancing:CreateRule",
+                           "elasticloadbalancing:CreateListener",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:RemoveTags",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:RemoveTags",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:SetSubnets",
+                           "elasticloadbalancing:SetSecurityGroups",
+                           "elasticloadbalancing:SetIpAddressType",
+                           "elasticloadbalancing:ModifyTargetGroupAttributes",
+                           "elasticloadbalancing:ModifyTargetGroup",
+                           "elasticloadbalancing:ModifyLoadBalancerAttributes",
+                           "elasticloadbalancing:DeleteTargetGroup",
+                           "elasticloadbalancing:DeleteLoadBalancer",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = "elasticloadbalancing:AddTags"
+                       Condition = {
+                           Null         = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
+                           StringEquals = {
+                               "elasticloadbalancing:CreateAction" = [
+                                   "CreateTargetGroup",
+                                   "CreateLoadBalancer",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:RegisterTargets",
+                           "elasticloadbalancing:DeregisterTargets",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:SetWebAcl",
+                           "elasticloadbalancing:RemoveListenerCertificates",
+                           "elasticloadbalancing:ModifyRule",
+                           "elasticloadbalancing:ModifyListener",
+                           "elasticloadbalancing:AddListenerCertificates",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = {
+           "owner" = "education-eks"
        }
    }

  # module.alb_ingress_controller_role.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "CodeCationALBIngressController"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "owner" = "education-eks"
        }
+       unique_id             = (known after apply)
    }

  # module.alb_ingress_controller_role.aws_iam_role_policy_attachment.load_balancer_controller[0] will be created
+   resource "aws_iam_role_policy_attachment" "load_balancer_controller" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "CodeCationALBIngressController"
    }

  # module.alb_ingress_controller_role.aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       role       = "CodeCationALBIngressController"
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "aws-ebs-csi-driver"
+       id                 = (known after apply)
+       kubernetes_version = "1.28"
+       most_recent        = true
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "coredns"
+       id                 = (known after apply)
+       kubernetes_version = "1.28"
+       most_recent        = true
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "kube-proxy"
+       id                 = (known after apply)
+       kubernetes_version = "1.28"
+       most_recent        = true
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "vpc-cni"
+       id                 = (known after apply)
+       kubernetes_version = "1.28"
+       most_recent        = true
+       version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
+       certificates = (known after apply)
+       id           = (known after apply)
+       url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
+   resource "aws_cloudwatch_log_group" "this" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/aws/eks/education-cluster/cluster"
+       name_prefix       = (known after apply)
+       retention_in_days = 90
+       skip_destroy      = false
+       tags              = {
+           "Environment" = "education"
+           "Name"        = "/aws/eks/education-cluster/cluster"
+           "Terraform"   = "true"
        }
+       tags_all          = {
+           "Environment" = "education"
+           "Name"        = "/aws/eks/education-cluster/cluster"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "Environment"
+       resource_id = (known after apply)
+       value       = "education"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Terraform"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "Terraform"
+       resource_id = (known after apply)
+       value       = "true"
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
+   resource "aws_eks_access_entry" "this" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = "education-cluster"
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = (known after apply)
+       modified_at       = (known after apply)
+       principal_arn     = "arn:aws:iam::820116308106:role/admin"
+       tags              = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all          = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
+       type              = "STANDARD"
+       user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "education-cluster"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
+       principal_arn = "arn:aws:iam::820116308106:role/admin"

+       access_scope {
+           type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "aws-ebs-csi-driver"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = "education-cluster"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "coredns"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = "education-cluster"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "kube-proxy"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = "education-cluster"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "vpc-cni"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = "education-cluster"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
+   resource "aws_eks_cluster" "this" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = [
+           "api",
+           "audit",
+           "authenticator",
        ]
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       name                      = "education-cluster"
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = {
+           "Environment"           = "education"
+           "Terraform"             = "true"
+           "terraform-aws-modules" = "eks"
        }
+       tags_all                  = {
+           "Environment"           = "education"
+           "Terraform"             = "true"
+           "owner"                 = "education-eks"
+           "terraform-aws-modules" = "eks"
        }
+       version                   = "1.28"

+       access_config {
+           authentication_mode                         = "API_AND_CONFIG_MAP"
+           bootstrap_cluster_creator_admin_permissions = false
        }

+       encryption_config {
+           resources = [
+               "secrets",
            ]

+           provider {
+               key_arn = (known after apply)
            }
        }

+       kubernetes_network_config {
+           ip_family         = "ipv4"
+           service_ipv4_cidr = (known after apply)
+           service_ipv6_cidr = (known after apply)
        }

+       timeouts {}

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = true
+           endpoint_public_access    = true
+           public_access_cidrs       = [
+               "0.0.0.0/0",
            ]
+           security_group_ids        = (known after apply)
+           subnet_ids                = (known after apply)
+           vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+   resource "aws_iam_openid_connect_provider" "oidc_provider" {
+       arn             = (known after apply)
+       client_id_list  = [
+           "sts.amazonaws.com",
        ]
+       id              = (known after apply)
+       tags            = {
+           "Environment" = "education"
+           "Name"        = "education-cluster-eks-irsa"
+           "Terraform"   = "true"
        }
+       tags_all        = {
+           "Environment" = "education"
+           "Name"        = "education-cluster-eks-irsa"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
+       thumbprint_list = (known after apply)
+       url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
+   resource "aws_iam_policy" "cluster_encryption" {
+       arn         = (known after apply)
+       description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "education-cluster-cluster-ClusterEncryption"
+       path        = "/"
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all    = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "eks.amazonaws.com"
                        }
+                       Sid       = "EKSClusterAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "education-cluster-cluster-"
+       path                  = "/"
+       tags                  = {
+           "Environment" = "education"
+           "Terraform"   = "true"
        }
+       tags_all              = {
+           "Environment" = "education"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = "education-cluster-cluster"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = [
+                               "logs:CreateLogGroup",
                            ]
+                           Effect   = "Deny"
+                           Resource = "*"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.additional["policy_arn"] will be created
+   resource "aws_iam_role_policy_attachment" "additional" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
+   resource "aws_iam_role_policy_attachment" "cluster_encryption" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
+       role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
+   resource "aws_security_group" "cluster" {
+       arn                    = (known after apply)
+       description            = "EKS cluster security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "education-cluster-cluster-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "education"
+           "Name"        = "education-cluster-cluster"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "education"
+           "Name"        = "education-cluster-cluster"
+           "Terraform"   = "true"
+           "owner"       = "education-eks"
        }
+       vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.node[0] will be created
+   resource "aws_security_group" "node" {
+       arn                    = (known after apply)
+       description            = "EKS node shared security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "education-cluster-node-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment"                             = "education"
+           "Name"                                    = "education-cluster-node"
+           "Terraform"                               = "true"
+           "kubernetes.io/cluster/education-cluster" = "owned"
        }
+       tags_all               = {
+           "Environment"                             = "education"
+           "Name"                                    = "education-cluster-node"
+           "Terraform"                               = "true"
+           "kubernetes.io/cluster/education-cluster" = "owned"
+           "owner"                                   = "education-eks"
        }
+       vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Node groups to cluster API"
+       from_port                = 443
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node groups"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 4443/tcp webhook"
+       from_port                = 4443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 4443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 6443/tcp webhook"
+       from_port                = 6443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 6443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 8443/tcp webhook"
+       from_port                = 8443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 8443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 9443/tcp webhook"
+       from_port                = 9443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 9443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node kubelets"
+       from_port                = 10250
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 10250
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node ingress on ephemeral ports"
+       from_port                = 1025
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 65535
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS UDP"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] will be created
+   resource "time_sleep" "this" {
+       create_duration = "30s"
+       id              = (known after apply)
+       triggers        = {
+           "cluster_certificate_authority_data" = (known after apply)
+           "cluster_endpoint"                   = (known after apply)
+           "cluster_name"                       = "education-cluster"
+           "cluster_service_cidr"               = (known after apply)
+           "cluster_version"                    = "1.28"
        }
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Name" = "education-vpc-eks-default"
        }
+       tags_all               = {
+           "Name"  = "education-vpc-eks-default"
+           "owner" = "education-eks"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       egress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       ingress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Name" = "education-vpc-eks-default"
        }
+       tags_all               = {
+           "Name"  = "education-vpc-eks-default"
+           "owner" = "education-eks"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "education-vpc-eks-default"
        }
+       tags_all               = {
+           "Name"  = "education-vpc-eks-default"
+           "owner" = "education-eks"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "education-vpc-eks-eu-west-1a"
        }
+       tags_all             = {
+           "Name"  = "education-vpc-eks-eu-west-1a"
+           "owner" = "education-eks"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:x: Error applying plan in [tf-apply / Kabisa-playground-anas #3](https://github.com/anasgrt/eks_project/actions/runs/8583624242)